//ACCOX    JOB 'DB2 MAINT',CLASS=A,MSGCLASS=X,REGION=0M
//* Example only - customize libraries and dataset names.
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=50
//STEPLIB  DD DISP=SHR,DSN=DSN.V13.SDSNLOAD
//SYSEXEC  DD DISP=SHR,DSN=USER.DB2MAINT.REXX
//ACCOXPAR DD DISP=SHR,DSN=USER.DB2MAINT.PARMS(ACCOXPAR)
//ACCOXOUT DD DISP=(NEW,CATLG,DELETE),DSN=USER.DB2MAINT.ACCOXOUT,
//            UNIT=SYSDA,SPACE=(CYL,(5,5)),DCB=(RECFM=VB,LRECL=1000)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
  %DSNACCOX DB2A
/*
