//UTGEN    JOB 'DB2 MAINT',CLASS=A,MSGCLASS=X,REGION=0M
//* Example only - customize libraries and dataset names.
//STEP1    EXEC PGM=IKJEFT01,DYNAMNBR=50
//SYSEXEC  DD DISP=SHR,DSN=USER.DB2MAINT.REXX
//ACCOXOUT DD DISP=SHR,DSN=USER.DB2MAINT.ACCOXOUT
//UTGENPAR DD DISP=SHR,DSN=USER.DB2MAINT.PARMS(UTGENPAR)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
  %DB2UTGEN
/*
